# Undersök kunddata

bla bla bla

In [43]:
import pandas as pd

df = pd.read_csv('customer_data.csv')
dfov = pd.read_csv('customer_data_only_valid.csv')

dfov.head()

,name,age,email,phone,purchase_frequency
0,Jack Jennings,40,jack.jennings@distansakademin.se,0772-268726,high
1,Jesse Jacksön,31,jesse.jackson@distansakademin.se,0752-745119,high
2,Jane Jöhanssön,19,jane.johansson@distansakademin.se,0774-522360,medium
3,Jane Jöhnsön,59,jane.johnson@distansakademin.se,0772-854728,low
4,Jenny Janssen,19,jenny.janssen@distansakademin.se,0787-416139,high

In [17]:
# Information / sammanfattning om vår data
dfov.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   name                10000 non-null  object
 1   age                 10000 non-null  int64
 2   email               10000 non-null  object
 3   phone               10000 non-null  object
 4   purchase_frequency  10000 non-null  object
dtypes: int64(1), object(4)
memory usage: 390.8+ KB

In [18]:
dfov.describe()

                age
count  10000.000000
mean      41.318400
std       13.872882
min       18.000000
25%       29.000000
50%       41.000000
75%       53.000000
max       65.000000

In [19]:
dfov["purchase_frequency"]

0         high
1         high
2       medium
3          low
4         high
         ...
9995       low
9996    medium
9997    medium
9998    medium
9999      high
Name: purchase_frequency, Length: 10000, dtype: object

In [21]:
dfov["purchase_frequency"].value_counts()

medium    3404
high      3307
low       3289
Name: purchase_frequency, dtype: int64

In [23]:
df["age"].value_counts()

invalid_age    1710
58              204
43              195
33              192
49              191
36              190
56              183
18              181
54              179
30              179
39              178
61              178
23              177
38              176
25              176
52              176
46              175
47              175
35              175
37              174
55              174
57              173
59              172
65              172
28              171
41              171
24              171
22              171
64              170
45              170
63              170
20              170
44              169
53              168
51              168
42              168
32              167
48              166
29              166
60              163
40              163
19              162
50              162
62              162
34              161
31              160
21              160
27              159
26              157
Name: age, dtype: int64

In [26]:
df.tail()

,name,age,email,phone,purchase_frequency
9995,Jim Jenkins,50,jim.jenkins@distansakademin.se,0733-417754,medium
9996,Jöhn Jöhnsön,20,john.johnson@distansakademin.se,0747-451072,high
9997,Jenny Jöhanssön,52,jenny.johansson@distansakademin.se,0736-878179,high
9998,Jack Jöhanssön,41,jack.johansson@distansakademin.se,0743-927725,medium
9999,Jack Jöhnsön,32,jack.johnson@distansakademin.se,0735-446912,low

In [27]:
dfov.tail()

,name,age,email,phone,purchase_frequency
9995,Jade Jönes,44,jade.jones@distansakademin.se,0717-632360,low
9996,Jesse Jacksön,64,jesse.jackson@distansakademin.se,0762-509258,medium
9997,Jenny Jenkins,59,jenny.jenkins@distansakademin.se,0732-468574,medium
9998,Jenny Smith,54,jenny.smith@distansakademin.se,0724-294835,medium
9999,Jasper Jöhnsön,43,jasper.johnson@distansakademin.se,0774-112567,high

In [30]:
df.shape[0]

5

In [32]:
dfov.shape

(10000, 5)

In [35]:
dfov.dtypes

name                  object
age                    int64
email                 object
phone                 object
purchase_frequency    object
dtype: object

In [36]:
df.nunique()

name                    90
age                     49
email                   91
phone                 9998
purchase_frequency       3
dtype: int64

In [39]:
dfov.isna().sum()

name                  0
age                   0
email                 0
phone                 0
purchase_frequency    0
dtype: int64

In [48]:
df[df["email"] == "invalid_mail"].shape[0]

1235

In [51]:
df[df["age"] == "invalid_age"].shape[0]

1710

In [53]:
df[df["phone"].str.contains("0736-")]

,name,age,email,phone,purchase_frequency
156,Jill Jönes,37,jill.jones@distansakademin.se,0736-782232,medium
206,Jack Jönes,invalid_age,jack.jones@distansakademin.se,0736-366036,medium
220,Jill Jennings,invalid_age,invalid_mail,0736-294382,high
381,Jane Janssen,invalid_age,jane.janssen@distansakademin.se,0736-453155,medium
399,Jöhn Jennings,45,invalid_mail,0736-889918,high
...,...,...,...,...,...
9418,Jill Jensen,invalid_age,jill.jensen@distansakademin.se,0736-735997,high
9425,Jöhn Jönes,59,john.jones@distansakademin.se,0736-285654,high
9483,Jade Janssen,53,jade.janssen@distansakademin.se,0736-902903,medium
9521,Jane Jennings,33,invalid_mail,0736-297094,low
9997,Jenny Jöhanssön,52,jenny.johansson@distansakademin.se,0736-878179,high

In [58]:
df[df.isna().any(axis=1)].shape[0]

0